/*--------------------------------------------------------------------------------
* Copyright (c) 2017,西北农林科技大学信息学院计算机科学系
* All rights reserved.
*
* 文件名称：main.c
* 文件标识：见配置管理计划书
* 摘要：念整数的演示代码。
* 题目描述：要读入一个整数，范围是[-100000,100000]。
*          然后，用汉语拼音将这个整数的每一位输出出来。
*          如输入1234，则输出：yi er san si
*          注意，每个字的拼音之间有一个空格，但是最后的字后面没有空格。
*          当遇到负数时，在输出的开头加上“fu”，如-2341输出为：
*          fu er san si yi
*
* 输入格式：一个整数，范围是[-100000,100000]。
*
* 输出格式：表示这个整数的每一位数字的汉语拼音，
*          每一位数字的拼音之间以空格分隔，末尾没有空格。
*
* 输入样例：
*          -30
*
* 输出样例：
*          fu san ling
*
* 解决思路：一个字符串查找表来实现。
*
* 当前版本：1.0
* 作者：耿楠
* 完成日期：2018年12月11日
*
* 取代版本：无
* 原作者：
* 完成日期：
--------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

// 宏定义
#define MAXDEG 10

// 函数定义
char * Digit2PyWithLUTBysprintf(int);
char * Digit2PyWithLUTByInt2Str(int);
char * Digit2PyWithLUTBySplitInt(int);
// 测试
int main()
{
    int val;
    char *str;

    //scanf("%d", &val)

    //val = -723405;
    val = 723405;
    printf("Int = %d\n", val);

    printf("sprintf:\n");
    str = Digit2PyWithLUTBysprintf(val); // 用sprintf将整数转换为字符串
    puts(str);
    free(str);

    printf("Int2Str:\n");
    str =  Digit2PyWithLUTByInt2Str(val); // 用Int2Str将整数转换为字符串
    puts(str);
    free(str);

    printf("SplitInt2Str:\n");
    str =  Digit2PyWithLUTBySplitInt(val); // 用SplitInt2Str将整数转换为字符串
    puts(str);
    free(str);

    return 0;
}

// 函数定义

//-----------------------------------------------------------------------------------------------
// 名称: void ReverseStr(char *str, int left, int right)
// 功能: 对指定范围内的字符串进行逆序操作
// 算法: 分别从字符串的头和尾部向中间进发，依次交换头尾的值，直到在中间相遇。
// 参数:
//       [char *str] --- 要进行逆序的字符串指针
//       [int left] --- 起始位置
//       [int right] --- 结束位置
// 返回: [void]  --- 无
// 作者: 耿楠
// 日期: 2018年12月04日
// 注意: 这是一个辅助函数，其原型不应该出现在函数原型部分
//-----------------------------------------------------------------------------------------------
void ReverseStr(char *str, int left, int right)
{
    char tmp;
    while(left < right)
    {
        tmp = str[left];
        str[left++] = str[right];
        str[right--] = tmp;
    }
}

//-----------------------------------------------------------------------------------------------
// 名称: char *Int2Str(char *str, int n)
// 功能: 将一个整数转换为字符串
// 算法: 从个位开始用/和%运算得到各位，然后反向字符串。
// 参数:
//       [char *str] --- 结果字符串指针
//       [int n] --- 要转换的整数
// 返回: [char *]  --- 结果字符串的首地址
// 作者: 耿楠
// 日期: 2018年12月11日
// 注意: 这是一个辅助函数，其原型不应该出现在函数原型部分
//-----------------------------------------------------------------------------------------------
char *Int2Str(char *str, int n)
{
    int t = abs(n); // 求绝对值
    int d = 0;
    int i  = 0;
    int len = 0;

    while(t)
    {
        d = t % 10; // 取出最低位

        str[i] = d + '0'; // 转换成字符

        // 准备处理下一位
        t = t / 10; // 减去1位
        i++; // 计数加1
    }

    if(n < 0) // 处理负号
    {
        str[i] = '-';
        i++;
    }

    str[i] = '\0'; // 字符串结束标志

    len = strlen(str);

    ReverseStr(str, 0, len - 1); // 反转字符串

    return str;
}

//-----------------------------------------------------------------------------------------------
// 名称: char *SplitInt2Str(char *str, int n)
// 功能: 将一个整数转换为字符串
// 算法: 先计算出整数最高位权重(10^n)，再用/和%运算从最高位开始取得各位构成字符串。
// 参数:
//       [char *str] --- 结果字符串指针
//       [int n] --- 要转换的整数
// 返回: [char *]  --- 结果字符串的首地址
// 作者: 耿楠
// 日期: 2018年12月12日
// 注意: 这是一个辅助函数，其原型不应该出现在函数原型部分
//-----------------------------------------------------------------------------------------------
char *SplitInt2Str(char *str, int n)
{
    int t = abs(n); // 求绝对值
    int d = 0;
    int i  = 0;

    unsigned int mask = 1; // 位的权重(10^n)

    // 从低位向高位拆数，计算最高位权重(10^n)
    while(t > 9)
    {
        t /= 10;
        mask *= 10;
    }

    if(n < 0) // 处理负号
    {
        str[i] = '-';
        i++;
    }

    t = abs(n); // 恢复t

    while(t)
    {
        d = t / mask; // 取出最高位

        str[i] = d + '0'; // 转换成字符

        // 准备处理下一位
        t %= mask;
        mask /= 10;

        i++; // 计数加1
    }

    str[i] = '\0'; // 字符串结束标志

    return str;
}

//-----------------------------------------------------------------------------------------------
// 名称: int GetResultStrSize(const char *str)
// 功能: 将整数转换为由各位数字组成的拼音构成的字符串
// 算法: 利用查找表实现
// 参数:
//       [const char *str] --- 整数字符串指针
// 返回: [int]  --- 需要保存结果的字符串长度
// 作者: 耿楠
// 日期: 2018年12月11日
// 注意: 这是一个辅助函数，其原型不应该出现在函数原型部分
//-----------------------------------------------------------------------------------------------
int GetResultStrSize(const char *str)
{
    size_t size = 0;
    int len, i;

    // "ling"到"jiu"各字符串的长度，各个字符串包含1个尾部空格
    size_t pylen[] = {5, 3, 3, 4, 3, 3, 4, 3, 3, 4};

    // 整数字符串长度
    len = strlen(str);

    len = strlen(str);
    i = 0;
    // 负号
    if(str[i] == '-')
    {
        size += 3; // "fu "的长度
        i++;
    }

    // 计算结果字符串长度
    for (; i < len; i++)
    {
        size += pylen[str[i] - '0']; // str[i] - '0'得到pylen数组索引
    }

    return size - 1; // 返回计算的长度，不包括最后一个空格
}

//-----------------------------------------------------------------------------------------------
// 名称: char *DigitStr2PyStr(char *str)
// 功能: 将一个整数字符串转换为拼音字符串
// 算法: 先计算出结果字符串长度，再开辟内存，然后通过查找表链接成字符串。
// 参数:
//       [char *str] --- 整数字符串指针
// 返回: [char *]  --- 结果字符串的首地址
// 作者: 耿楠
// 日期: 2018年12月12日
// 注意: 这是一个辅助函数，其原型不应该出现在函数原型部分
//      另外，该函数返回的是动态内存的首地址，调用该函数后，注意需要释放内存。
//-----------------------------------------------------------------------------------------------
char *DigitStr2PyStr(char *str)
{
    // 数字拼音查找表
    char *pinyin[] =
    {
        "ling ", "yi ", "er ", "san ", "si ", "wu ", "liu ", "qi ", "ba ", "jiu "
    };

    int len, i;

    char *p = NULL; // 结果字符串指针

    // 字符串长度(结果字符串内存大小)
    size_t size = GetResultStrSize(str);

    // 申请结果数组空间
    p = (char *)malloc((size + 1) * sizeof(char));
    if(p == NULL)
    {
        return NULL; // 内存分配出错
    }
    // 清0初始化
    memset(p, '\0', (size + 1) * sizeof(char));

    // 转换字符串
    len = strlen(str);
    i = 0;
    // 负号
    if(str[i] == '-')
    {
        strcat(p, "fu "); // 输出"fu "
        i++;
    }
    // 其它数字
    for (; i < len; i++)
    {
        strcat(p, pinyin[str[i] - '0']); // 输出拼音
    }

    // 删除最后一个空格
    len = strlen(p);
    p[len - 1] = '\0';

    return p;
}

//-----------------------------------------------------------------------------------------------
// 名称: char * Digit2PyWithLUTBysprintf(int n)
// 功能: 将整数转换为由各位数字组成的拼音构成的字符串
// 算法: 利用sprintf将整数转换为字符串后进行处理
// 参数:
//       [int n] --- 需要转换的整数
// 返回: [char *]  --- 结果字符串首地址
// 作者: 耿楠
// 日期: 2018年12月12日
// 注意: 由于该函数调用DigitStr2PyStr()申请了动态内存，在该函数调用结束后，需要有释放内存操作。
//-----------------------------------------------------------------------------------------------
char *Digit2PyWithLUTBysprintf(int n)
{
    char str[MAXDEG];

    char *p = NULL;

    // 利用sprintf函数将整数n输出到字符数组
    sprintf(str, "%d", n);

    // 将整数字符串转换成拼音字符串
    p = DigitStr2PyStr(str);

    return p;
}

//-----------------------------------------------------------------------------------------------
// 名称: char * Digit2PyWithLUTByInt2Str(int n)
// 功能: 将整数转换为由各位数字组成的拼音构成的字符串
// 算法: 利用自定义函数Int2Str将整数转换为字符串后进行处理
// 参数:
//       [int n] --- 需要转换的整数
// 返回: [char *]  --- 结果字符串首地址
// 作者: 耿楠
// 日期: 2018年12月11日
// 注意: 由于该函数调用DigitStr2PyStr()申请了动态内存，在该函数调用结束后，需要有释放内存操作。
//-----------------------------------------------------------------------------------------------
char *Digit2PyWithLUTByInt2Str(int n)
{
    char str[MAXDEG];

    char *p = NULL;

    // 从最低位分解整数后再逆序得到整数字符串
    Int2Str(str, n);

    p = DigitStr2PyStr(str);

    return p;
}

//-----------------------------------------------------------------------------------------------
// 名称: char * Digit2PyWithLUTBySplitInt(int n)
// 功能: 将整数转换为由各位数字组成的拼音构成的字符串
// 算法: 利用自定义函数SplitInt2Str将整数转换为字符串后进行处理
// 参数:
//       [int n] --- 需要转换的整数
// 返回: [char *]  --- 结果字符串首地址
// 作者: 耿楠
// 日期: 2018年12月12日
// 注意: 由于该函数调用DigitStr2PyStr()申请了动态内存，在该函数调用结束后，需要有释放内存操作。
//-----------------------------------------------------------------------------------------------
char *Digit2PyWithLUTBySplitInt(int n)
{
    char str[MAXDEG];

    char *p = NULL;

    // 从最低位分解整数后再逆序得到整数字符串
    SplitInt2Str(str, n);

    p = DigitStr2PyStr(str);

    return p;
}
