/*--------------------------------------------------------------------------------
* Copyright (c) 2017,西北农林科技大学信息学院计算机科学系
* All rights reserved.
*
* 文件名称：main.c
* 文件标识：见配置管理计划书
* 摘要：演示用函数指针数组实现运算符的穷举法(狂人C程序员入门必备,PP:330-331)。
* 例如：
*          请添加'+'或‘-'使得等式成立，
*          1、2 2 2 2 = 0
*          2、782 59 456 87 918 = 2010
*          3、6 5 4 3 2 1 = 1
*
* 当前版本：1.0
* 作者：耿楠
* 完成日期：2017年11月22日
*
* 取代版本：无
* 原作者：耿楠
* 完成日期：2017年11月22日
------------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define N 2

//函数原型
int Add(int, int); // 加法
int Sub(int, int); // 减法
void PrintOp3(int, int, int, int, int); // 需要处理的4个数字及其要求的结果
void PrintOp4(int, int, int, int, int, int); // 需要处理的5个数字及其要求的结果

int main()
{
    // 求2 2 2 2 = 0之间的运算符
    PrintOp3(2, 2, 2, 2, 0);
    // 求782 59 456 87 918 = 2010之间的运算符
    PrintOp4(782, 59, 456, 87, 918, 2010);


    return 0;
}

//-----------------------------------------------------------------------------------------------
// 名称：void PrintOp3(int a1, int a2, int a3, int a4, int result);
// 功能：找到并输出四个整数中添加不同'+'或'-'运算符的结果。
//           用三重循环实现了对运算"动作"的穷举。
// 参数：
//       [int a1] --- 数a1
//       [int a2] --- 数a2
//       [int a3] --- 数a3
//       [int a4] --- 数a4
//       [int result] --- 执行的结果
// 返回：[void] --- 无
// 作者：耿楠
// 日期：2017年11月22日
//-----------------------------------------------------------------------------------------------
void PrintOp3(int a1, int a2, int a3, int a4, int result)
{
    int (*pFun[N])(int, int) = {Add, Sub}; // 运算操作函数指针数组
    char Op[N] = {'+', '-'}; // 运算符号

    int i, j, k;

    for(i = 0; i < N; i++)
    {
        for(j = 0; j < N; j++)
        {
            for(k = 0; k < N; k++)
            {
                if(pFun[k](pFun[j](pFun[i](a1, a2), a3), a4) == result)
                {
                    printf("%d %c %d %c %d %c %d = %d\n", a1, Op[i],
                           a2, Op[j],
                           a3, Op[k],
                           a4, result);
                }
            }
        }
    }
}

//-----------------------------------------------------------------------------------------------
// 名称：void PrintOp4(int a1, int a2, int a3, int a4, int a5, int result);
// 功能：找到并输出五个整数中添加不同'+'或'-'运算符的结果。
//           用四重循环实现了对运算"动作"的穷举。
// 参数：
//       [int a1] --- 数a1
//       [int a2] --- 数a2
//       [int a3] --- 数a3
//       [int a4] --- 数a4
//       [int a5] --- 数a5
//       [int result] --- 执行的结果
// 返回：[void] --- 无
// 作者：耿楠
// 日期：2017年11月22日
//-----------------------------------------------------------------------------------------------
void PrintOp4(int a1, int a2, int a3, int a4, int a5, int result)
{
    int (*pFun[N])(int, int) = {Add, Sub}; // 运算操作函数指针数组
    char Op[N] = {'+', '-'}; // 运算符号

    int i, j, k, l;

    for(i = 0; i < N; i++)
    {
        for(j = 0; j < N; j++)
        {
            for(k = 0; k < N; k++)
            {
                for(l = 0; l < N; l++)
                {
                    if(pFun[l](pFun[k](pFun[j](pFun[i](a1, a2), a3), a4), a5) == result)
                    {
                        printf("%d %c %d %c %d %c %d %c %d = %d\n", a1, Op[i],
                               a2, Op[j],
                               a3, Op[k],
                               a4, Op[l],
                               a5, result);
                    }
                }
            }
        }
    }
}



//-----------------------------------------------------------------------------------------------
// 名称：int Add(int a, int b);
// 功能：实现两个整数的加法。
// 参数：
//       [int a] --- 待加数a
//       [int b] --- 待加数b
// 返回：[int] --- 两个数的和
// 作者：耿楠
// 日期：2017年11月22日
//-----------------------------------------------------------------------------------------------
int Add(int a, int b)
{
    return a + b;
}

//-----------------------------------------------------------------------------------------------
// 名称：int Sub(int a, int b);
// 功能：实现两个整数的加法。
// 参数：
//       [int a] --- 被减数a
//       [int b] --- 减数b
// 返回：[int] --- 两个数的差
// 作者：耿楠
// 日期：2017年11月22日
//-----------------------------------------------------------------------------------------------
int Sub(int a, int b)
{
    return a - b;
}
