/*--------------------------------------------------------------------------------
* Copyright (c) 2017,西北农林科技大学信息学院计算机科学系
* All rights reserved.
*
* 文件名称：main.c
* 文件标识：见配置管理计划书
* 摘要：演示fopen/fclose函数及命令行参数的使用。
*
* 当前版本：1.0
* 作者：耿楠
* 完成日期：2017年11月10日
*
* 取代版本：无
* 原作者：耿楠
* 完成日期：2017年11月10日
--------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

// 函数原型
bool readable(const char *file);

//-----------------------------------------------------------------------------------------------
// 名称：int main(int argc, char *argv[])
// 功能：主函数，程序入口
// 参数：
//           [int argc] --- 命令行参数个数
//           [char *argv[]] --- 命令行参数指针数组
// 返回：[int]  --- 成功返回0，其它返回非0
// 作者：耿楠
// 日期：2017年11月10日
//-----------------------------------------------------------------------------------------------
int main(int argc, char *argv[])
{
    if (argc < 2) // 判断参数个数(程序名称也算1个参数)
    {
        printf("usage: %s  <filenames>\n", argv[0]);
        exit(EXIT_FAILURE);
    }

     // 循环检测每个文件能否打开
    for (int i = 1; i < argc; i++)
    {
        if (readable(argv[i]))
        {
            printf("Y: %s\n", argv[i]);
        }
        else
        {
            printf("N: %s\n", argv[i]);
        }
    }

    return 0;
}

//-----------------------------------------------------------------------------------------------
// 名称：bool readable(const char *filename)
// 功能：测试文件能否打开
// 参数：
//           [const char *filename] --- 文件名
// 返回：[bool]  --- 成功返回true，其它返回false
// 作者：耿楠
// 日期：2017年11月10日
//-----------------------------------------------------------------------------------------------
bool readable(const char *filename)
{
    FILE *fp; // 声明文件指针
    if ((fp = fopen(filename, "r")) == NULL)
    {
        return false; // 文件打开失败
    }

    fclose(fp); // 关闭文件
    return true;
}
